## Lab 3 : 외부 데이터 이용하기

In [2]:
import pandas as pd

df_exam = pd.read_excel('excel_exam.xlsx')
df_exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [3]:
df_exam = pd.read_excel('excel_exam.xlsx').set_index('id')

df_exam.head()

    nclass  math  english  science
id
1        1    50       98       50
2        1    60       97       60
3        1    45       86       78
4        1    30       98       58
5        2    25       80       65

In [4]:
df_exam['math'].sum()

1149

In [5]:
len(df_exam)

20

In [6]:
df_exam.sum()

nclass       60
math       1149
english    1698
science    1189
dtype: int64

In [7]:
df_exam.mean()

nclass      3.00
math       57.45
english    84.90
science    59.45
dtype: float64